# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales convolution channels
sr: False
# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2      #0
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4     #1
  - [-1, 3, C2f, [128, True]]                #2
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8     #3
  - [-1, 6, C2f, [256, True]]                #4
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16    #5
  - [-1, 6, C2f, [512, True]]                #6
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32   #7
  - [-1, 3, C2f, [1024, True]]               #8
  - [-1, 1, SPPF, [1024, 5]]  # 9            #9

# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   #10
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4 #11
  - [-1, 3, C2f, [512]]  # 13                    #12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]   #13
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3 #14
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)       #15

  - [-1, 1, Conv, [256, 3, 2]]                   #16
  - [[-1, 12], 1, Concat, [1]]  # cat head P4    #17
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)     #18

  - [-1, 1, Conv, [512, 3, 2]]                   #19
  - [[-1, 9], 1, Concat, [1]]  # cat head P5     #20
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)     #21

  - [[15, 18, 21], 1, Detect, [nc]]  # Detect(P3, P4, P5)#9
