# Ultralytics YOLO 🚀, GPL-3.0 license

# Parameters
nc: 4  # number of classes
depth_multiple: 0.33  # scales module repeats
width_multiple: 0.50  # scales spdConvolution channels
sr: True
l1: 6
l2: 12
c1: 128
c2: 512

# YOLOv8.0s backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Focus, [64, 3]]    # 0/0
  - [-1, 1, spdConv, [128, 3, 1]]   # 1/1
  - [-1, 1, space_to_depth, [1]] # 2
  - [-1, 3, C2f, [128, True]]    # 3/2
  - [-1, 1, spdConv, [256, 3, 1]]   # 4/3
  - [-1, 1, space_to_depth, [1]] # 5
  - [-1, 6, C2f, [256, True]]    # 6/4
  - [-1, 1, spdConv, [512, 3, 1]]   # 7/5
  - [-1, 1, space_to_depth, [1]] # 8
  - [-1, 6, C2f, [512, True]]    # 9/6
  - [-1, 1, spdConv, [1024, 3, 1]]  # 10/7
  - [-1, 1, space_to_depth, [1]] # 11
  - [-1, 3, C2f, [1024, True]]   # 12/8
  - [-1, 1, SPPCSPC, [1024]]     # 13/9
  - [-1, 1, PSA, [1024]]
# YOLOv8.0s head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 14/10
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4  # 15/11
  - [-1, 3, C2f, [512]]  # 13                     # 16/12

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]    # 17/13
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3  # 18/14
  - [-1, 3, C2f, [256]]  # 17 (P3/8-small)        # 19/15

  - [-1, 1, spdConv, [256, 3, 1]]                    # 20/16
  - [-1, 1, space_to_depth, [1]]                  # 21
  - [[-1, 17], 1, Concat, [1]] # cat head P4      # 22/17
  - [-1, 3, C2f, [512]]  # 20 (P4/16-medium)      # 23/18

  - [-1, 1, spdConv, [512, 3, 1]]                    # 24/19
  - [-1, 1, space_to_depth, [1]]                  # 25
  - [[-1, 14], 1, Concat, [1]]  # cat head P5     # 26/20
  - [-1, 3, C2f, [1024]]  # 23 (P5/32-large)      # 27/21

  - [[20, 24, 28], 1, Detect, [nc]]  # Detect(P3, P4, P5)# 11
