# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  s: [0.33, 0.50, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, Focus, [64, 3]] # 0-P1/2        0/0
  - [-1, 1, Conv, [128, 3, 1]] # 1-P2/4     1/1
  - [-1, 1, space_to_depth, [1]]    #       2
  - [-1, 3, C2f, [128, True]]  #            3/2
  - [-1, 1, Conv, [256, 3, 1]] # 3-P3/8     4/3
  - [-1, 1, space_to_depth, [1]]    #       5
  - [-1, 6, C2f, [256, True]] #             6/4
  - [-1, 1, SCDown, [512, 3, 2]] # 5-P4/16  7/5
  - [-1, 6, C2f, [512, True]] #             8/6
  - [-1, 1, SCDown, [1024, 3, 2]] # 7-P5/32 9/7
  - [-1, 3, C2fCIB, [1024, True, True]] #   10/8
  - [-1, 1, SPPF, [1024, 5]] #              11/9
  - [-1, 1, PSA, [1024]] #                  12/10

# YOLOv8.0n head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]              #13/11
  - [[-1, 8], 1, Concat, [1]] # cat backbone P4             #14/12
  - [-1, 3, C2f, [512]] # 13                                #15/13

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]              #16/14
  - [[-1, 6], 1, Concat, [1]] # cat backbone P3             #17/15
  - [-1, 3, C2f, [256]] # 16 (P3/8-small)                   #18/16

  - [-1, 1, Conv, [256, 3, 1]]                              #19/17
  - [-1, 1, space_to_depth, [1]]                            #20
  - [[-1, 15], 1, Concat, [1]] # cat head P4                #21/18
  - [-1, 3, C2f, [512]] # 19 (P4/16-medium)                 #22/19

  - [-1, 1, SCDown, [512, 3, 2]]                            #23/20
  - [[-1, 12], 1, Concat, [1]] # cat head P5                #24/21
  - [-1, 3, C2fCIB, [1024, True, True]] # 22 (P5/32-large)  #25/22

  - [[18, 22, 25], 1, v10Detect, [nc]] # Detect(P3, P4, P5) #21
